Revit 2024 API
BuiltInFailures.StructuralConnectionFailures.StructuralConnectionWrongType Property
 Structural Connection has an inappropriate type assigned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StructuralConnectionWrongType { get; }
Visual Basic
Public Shared ReadOnly Property StructuralConnectionWrongType As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StructuralConnectionWrongType {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace